IDEA Open Model
Member Class
Compatible with IDEA StatiCa 20.1
 Member identification
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.Member
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class Member
Public Class Member
The Member type exposes the following members.
Constructors
Name | Description
Member()
 Constructor
Member(MemberType, Int32)
 Constructor
Top
Properties
Name | Description
Id
 Id of member
MemberType
 Type of member
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace